# Phase 1

## Structure du tableau

Titanic_train :  
PassengerId = identité --> Entier  
Survived = Survie ou non --> Binaire(entier) 0 pour non 1 pour oui  
Pclass = La classe --> Entier  
Name = Nom et prénom --> Varchar 85  
Sex --> 'male' ou 'female'  
Age --> Float  
SibSp = Nombre de frères et soeurs à bord du Titanic --> Entier  
Parch = Nombre de parents à bord du Titanic --> Entier  
Ticket = Numéro du ticket --> Varchar 20  
Fare = Tarif --> Float  
Cabin = Numéro du cabinet --> Varchar 15  
Embarked = Port d'embarquement --> Varchar 1 C = Cherbourg, Q = Queenstown, S = Southampton

# Structure des Relations

## 1ère Relation : Passengers

PassengerId integer primary key,  
Name varchar(85) ,  
Sex varchar(15),  
Age float 
  
## 2ème Relation : Tickets

Ticket varchar(20) ,  
PassengerId integer references PASSENGERS,  
Pclass integer,  
Fare float,  
Cabin varchar(15,  
Embarked varchar(4),  
primary Key(PassengerId)  
  
## 3ème Relation: Liens

PassengerId integer references PASSENGERS,  
Survived varchar(1),  
Sibsp integer ,  
Parch integer,  
Primary key( PassengerId)

# Tâches

## 1. Créer les relations

### (Kévin)  
Ecrire dans un fichier sql le script pour créer les 3 relations.  Done  

## 2. Remplir les relations

### (Pascal)  
Ecrire le script pour remplir les relations avec python et sa bibliothèque psycopg2.  
Prendre les données du fichier titanic_train.csv pour remplir les relations.  Done  

## 3. Créer des requêtes pour manipuler les relations et sa démo

### (Kévin et Pascal)  
Créer des requêtes agissant sur les relations.  
Afficher les résultats pour voir le fonctionnement.  Done

In [1]:
"""
Pascal Zhan
Créer un tableau de dictionnaire avec chaque passager
En ajustant les valeurs si les valeurs sont vides remplacer par null
Si il y a un ' doublé l'apostrophe pour pouvoir écrire
"""

import csv
 
def creer_base_passengers():
    """
    extrait le contenu du fichier titanic_train.csv
    renvoie les données sous forme d'un tableau de dictionnaires
    """
    passengers = []
    with open("titanic_train.csv", "r", encoding="utf8") as file:
        reader = csv.DictReader(file, delimiter = ",")
        for row in reader:
            passenger = dict(row)
            passengers.append(passenger)
    return passengers

def base_ajustee():
    """
    Ajuster les valeurs des dictionnaires pour fonctionner correctement avec sql
    
    """
    passengers = creer_base_passengers()
    for passenger in passengers:
        for key,value in passenger.items():
            if value == "" :
                passenger[key] = "null"
            if "'" in value:
                chaine = ""
                for c in passenger[key]:
                    if c == "'":
                        chaine += "'" +c
                    else:
                        chaine += c
                passenger[key] = chaine
    return passengers

In [2]:
"""
Kévin Postic
Script création des tables
Ne fonctionne pas ....
"""

%load_ext sql

%sql postgresql://12100404:p15@aquabdd/etudiants
print("connexion réussi") 
    
%%sql
SET datestyle TO "ISO , DMY";


drop table IF EXISTS TICKETS;
drop table IF EXISTS LIENS;
drop table IF EXISTS PASSENGERS;

create Table PASSENGERS
    (PassengerId integer primary key,
    Name varchar(85) ,
    Sex varchar(15),
    Age float  );

create Table TICKETS
        (Ticket varchar(20) ,
    PassengerId integer references PASSENGERS,
    Pclass integer,
    Fare float,
    Cabin varchar(15),
    Embarked varchar(4),
    primary Key(PassengerId) );

Create Table LIENS
    (PassengerId integer references PASSENGERS,
    Survived varchar(1),
    Sibsp integer ,
    Parch integer,
    Primary key( PassengerId ));

SyntaxError: invalid syntax (<ipython-input-2-2caab99435f5>, line 13)

# fichier : SAE_SQL.sql

set datestyle to "ISO , DMY";  

drop view IF EXISTS PASSAGERSEXE;  
drop view IF EXISTS PASSAGERCLASSE;  
drop table IF EXISTS TICKETS;  
drop table IF EXISTS LIENS;  
drop table IF EXISTS PASSENGERS;  

create Table PASSENGERS(PassengerId integer primary key, Name varchar(85) ,Sex varchar(15), Age float  );  

create Table TICKETS(Ticket varchar(20) ,PassengerId integer references PASSENGERS,Pclass integer,Fare float,Cabin varchar(15),Embarked varchar(4),primary Key(PassengerId) );  

Create Table LIENS(PassengerId integer references PASSENGERS,Survived varchar(1),Sibsp integer ,Parch integer,Primary key( PassengerId ));

In [3]:
import psycopg2

In [4]:
"""
Pascal Zhan
"""
conn = psycopg2.connect(database = "my_bd", user = "user1", password = "p15", host = "127.0.0.1",port = '5432')

cur = conn.cursor()

f = open("SAE_SQL.sql","r")
lines = f.read()

cur.execute(lines)#Efface les tables si elles existent puis créer les tables
f.close()        
     
conn.commit() #Changement dans la bdd
    
passengers = base_ajustee()

for passenger in passengers:
    cur.execute("""
        INSERT INTO PASSENGERS (PassengerId, Name, Sex, Age) VALUES ({},'{}','{}',{} ); 
        """.format(
        passenger["PassengerId"],
        passenger["Name"],
        passenger["Sex"],
        passenger["Age"]
        )) #On remplie la table PASSENGERS
    cur.execute("""
        INSERT INTO TICKETS (Ticket,PassengerId, Pclass, Fare, Cabin, Embarked) VALUES ('{}',{},{},{},'{}','{}'); 
        """.format(
        passenger["Ticket"],
        passenger["PassengerId"],
        passenger["Pclass"],
        passenger["Fare"],
        passenger["Cabin"],
        passenger["Embarked"]
        ))#On remplie la table TICKETS
    cur.execute("""
        INSERT INTO LIENS (PassengerId ,Survived , SibSp, Parch) VALUES ({},'{}',{},{}); 
        """.format(
        passenger["PassengerId"],
        passenger["Survived"],
        passenger["SibSp"],
        passenger["Parch"]
        ))#On remplie la table LIENS

conn.commit()

conn.close()

In [5]:
"""
Pascal Zhan
Kévin Postic
"""
conn = psycopg2.connect(database = "",# mettre la base de donnée
                        user = "", #mettre le nom d'utilisateur
                        password = "", # son mdp
                        host = "127.0.0.1",
                        port = '5432'
                       )

cur = conn.cursor()

## Démo

SELECT * FROM PASSENGERS;  
SELECT * FROM TICKETS;  
SELECT * FROM LIENS;   
SELECT Name,Sex FROM PASSENGERS WHERE Sex ='male';  
SELECT PassengerId,Embarked,Fare,Pclass FROM TICKETS WHERE Pclass=2;  
SELECT Name,Sex,Parch FROM PASSENGERS NATURAL JOIN LIENS WHERE Sex ='male';

Les listes sont longues, nous allons afficher que les 10 premiers.

In [6]:
cur.execute("SELECT PassengerId, Name, Sex, Age FROM PASSENGERS;")

print("\t".join(["PassengerId".rjust(11), "Name".rjust(85), "Sex".rjust(6), "Age".rjust(6)]))
rows = cur.fetchall()

for row in rows[:10]:
    p = str(row[0]).rjust(11)  
    n = row[1].rjust(85)
    s = row[2].rjust(6)
    age = str(row[3]).rjust(6)
    tab = [p,n,s,age]
    print("\t".join(tab))

PassengerId	                                                                                 Name	   Sex	   Age
          1	                                                              Braund, Mr. Owen Harris	  male	  22.0
          2	                                  Cumings, Mrs. John Bradley (Florence Briggs Thayer)	female	  38.0
          3	                                                               Heikkinen, Miss. Laina	female	  26.0
          4	                                         Futrelle, Mrs. Jacques Heath (Lily May Peel)	female	  35.0
          5	                                                             Allen, Mr. William Henry	  male	  35.0
          6	                                                                     Moran, Mr. James	  male	  None
          7	                                                              McCarthy, Mr. Timothy J	  male	  54.0
          8	                                                       Palsson, Master. Gosta Leonard	  male	   2.0
          9	                                    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)	female	  27.0
         10	                                                  Nasser, Mrs. Nicholas (Adele Achem)	female	  14.0

In [7]:
cur.execute("SELECT Ticket,PassengerId, Pclass, Fare, Cabin, Embarked FROM Tickets;")

print("\t".join(["Ticket".rjust(20),"PassengerId".rjust(11), "Pclass".rjust(2), "Fare".rjust(8), "Cabin".rjust(15), "Embarked".rjust(8) ]))
rows = cur.fetchall()

for row in rows[:10]:
    t = row[0].rjust(20)  
    p = str(row[1]).rjust(11)
    cl = str(row[2]).rjust(2)
    f = str(row[3]).rjust(8)
    c = row[4].rjust(15)
    e = row[5].rjust(8)
    tab = [t,p,cl,f,c,e]
    print("\t".join(tab))

              Ticket	PassengerId	Pclass	    Fare	          Cabin	Embarked
           A/5 21171	          1	 3	    7.25	           null	       S
            PC 17599	          2	 1	 71.2833	            C85	       C
    STON/O2. 3101282	          3	 3	   7.925	           null	       S
              113803	          4	 1	    53.1	           C123	       S
              373450	          5	 3	    8.05	           null	       S
              330877	          6	 3	  8.4583	           null	       Q
               17463	          7	 1	 51.8625	            E46	       S
              349909	          8	 3	  21.075	           null	       S
              347742	          9	 3	 11.1333	           null	       S
              237736	         10	 2	 30.0708	           null	       C

In [8]:
cur.execute("SELECT PassengerId ,Survived , SibSp, Parch FROM LIENS;")

print("\t".join(["PassengerId".rjust(11), "Survived".rjust(8), "SibSp".rjust(5), "Parch".rjust(5)]))
rows = cur.fetchall()

for row in rows[:10]:
    p = str(row[0]).rjust(11)  
    su = str(row[1]).rjust(8)
    si = str(row[2]).rjust(5)
    parch = str(row[3]).rjust(5)
    tab = [p,su,si,parch]
    print("\t".join(tab))

PassengerId	Survived	SibSp	Parch
          1	       0	    1	    0
          2	       1	    1	    0
          3	       1	    0	    0
          4	       1	    1	    0
          5	       0	    0	    0
          6	       0	    0	    0
          7	       0	    0	    0
          8	       0	    3	    1
          9	       1	    0	    2
         10	       1	    1	    0

In [9]:
cur.execute("SELECT Name,Sex FROM PASSENGERS WHERE Sex ='male';")
rows = cur.fetchall()

print("Name".rjust(85) + "\t" + "Sex".rjust(6))
for row in rows[:10]:
    n = row[0].rjust(85)
    s = row[1].rjust(6)
    print(n+"\t"+s)

                                                                                 Name	   Sex
                                                              Braund, Mr. Owen Harris	  male
                                                             Allen, Mr. William Henry	  male
                                                                     Moran, Mr. James	  male
                                                              McCarthy, Mr. Timothy J	  male
                                                       Palsson, Master. Gosta Leonard	  male
                                                       Saundercock, Mr. William Henry	  male
                                                          Andersson, Mr. Anders Johan	  male
                                                                 Rice, Master. Eugene	  male
                                                         Williams, Mr. Charles Eugene	  male
                                                                 Fynney, Mr. Joseph J	  male

In [10]:
cur.execute("SELECT PassengerId,Embarked,Fare,Pclass FROM TICKETS WHERE Pclass=2;")
rows = cur.fetchall()

print("\t".join(["PassengerId".rjust(11), "Embarked".rjust(8),"Fare".rjust(8), "Pclass".rjust(2) ]))

for row in rows[:10]:
    p = str(row[0]).rjust(11)
    cl = str(row[3]).rjust(2)
    f = str(row[2]).rjust(8)
    e = row[1].rjust(8)
    tab = [p,e,f,cl]
    print("\t".join(tab))

PassengerId	Embarked	    Fare	Pclass
         10	       C	 30.0708	 2
         16	       S	    16.0	 2
         18	       S	    13.0	 2
         21	       S	    26.0	 2
         22	       S	    13.0	 2
         34	       S	    10.5	 2
         42	       S	    21.0	 2
         44	       C	 41.5792	 2
         54	       S	    26.0	 2
         57	       S	    10.5	 2

In [11]:
cur.execute("SELECT Name,Sex,Parch FROM PASSENGERS NATURAL JOIN LIENS WHERE Sex ='male';")
rows = cur.fetchall()

print("Name".rjust(85) + "\t" + "Sex".rjust(6) + "\t" + "Parch".rjust(5) )
for row in rows[:10]:
    n = row[0].rjust(85)
    s = row[1].rjust(6)
    parch = str(row[2]).rjust(5)
    print(n+"\t" +s+"\t" +parch)

                                                                                 Name	   Sex	Parch
                                                              Braund, Mr. Owen Harris	  male	    0
                                                             Allen, Mr. William Henry	  male	    0
                                                                     Moran, Mr. James	  male	    0
                                                              McCarthy, Mr. Timothy J	  male	    0
                                                       Palsson, Master. Gosta Leonard	  male	    1
                                                       Saundercock, Mr. William Henry	  male	    0
                                                          Andersson, Mr. Anders Johan	  male	    5
                                                                 Rice, Master. Eugene	  male	    1
                                                         Williams, Mr. Charles Eugene	  male	    0
                                                                 Fynney, Mr. Joseph J	  male	    0

# requête demmandé

■ Combien de classes de passagers différentes y avait-il à bord du Titanic ?   
■ Combien de passagers y avait-il dans chaque classe?  
■ Combien de femmes et d'hommes y avait-il dans chaque classe?      
■ Comptez le nombre et le pourcentage de survivants et de passagers morts.  
■ Visualiser la répartition des passagers survivants et morts par classe.     
■ Visualiser la répartition des passagers survivants et des passagers décédés selon le sexe.

1)SELECT COUNT(DISTINCT Pclass) FROM TICKETS;  

2)SELECT Pclass,COUNT(Pclass) as nb_personne FROM TICKETS GROUP BY Pclass;  

3)SELECT Pclass,Sex,COUNT(Sex) as nb_personne FROM PASSENGERS NATURAL JOIN TICKETS GROUP BY Sex,Pclass;  

4)SELECT Survived,COUNT(Survived), COUNT(*) * 100.0 / (SELECT COUNT(*) FROM LIENS) AS percent FROM LIENS group by Survived;  

5)CREATE VIEW PASSAGERCLASSE AS SELECT Pclass,Survived,count(Survived) FROM LIENS NATURAL JOIN TICKETS GROUP BY Pclass,Survived;   
SELECT * FROM PASSAGERCLASSE;  

6)CREATE or replace VIEW PASSAGERSEXE AS SELECT Sex,Survived,COUNT(*) FROM LIENS NATURAL JOIN PASSENGERS GROUP BY Sex,Survived;  
SELECT * FROM PASSAGERSEXE;

# Combien de classes de passagers différentes y avait-il à bord du Titanic ?

In [12]:
cur.execute("SELECT COUNT(DISTINCT Pclass) FROM TICKETS;")
rows = cur.fetchone()
nb = rows[0]
print(f"A bord du Titanic,on distingue {nb} classes de passagers différentes.")

A bord du Titanic,on distingue 3 classes de passagers différentes.

# Combien de passagers y avait-il dans chaque classe?

In [13]:
cur.execute("SELECT Pclass,COUNT(Pclass) as nb_personne FROM TICKETS GROUP BY Pclass;")
rows = cur.fetchall()

for row in rows :
    classe,nombre = row
    print(f"On compte {nombre} personnes dans la classe {classe}.")

On compte 491 personnes dans la classe 3.
On compte 184 personnes dans la classe 2.
On compte 216 personnes dans la classe 1.

# Combien de femmes et d'hommes y avait-il dans chaque classe?

In [14]:
cur.execute("SELECT Pclass,Sex,COUNT(Sex) as nb_personne FROM PASSENGERS NATURAL JOIN TICKETS GROUP BY Sex,Pclass;")
rows = cur.fetchall()

def SexeGenre(sexe):
    if sexe == "male":
        return "d'hommes"
    return "de femmes"

for row in rows:
    classe,sex,n = row
    genre = SexeGenre(sex)
    print("Il y a {} {} dans la classe {}.".format(n,genre,classe))

Il y a 76 de femmes dans la classe 2.
Il y a 94 de femmes dans la classe 1.
Il y a 144 de femmes dans la classe 3.
Il y a 347 d'hommes dans la classe 3.
Il y a 108 d'hommes dans la classe 2.
Il y a 122 d'hommes dans la classe 1.

# Comptez le nombre et le pourcentage de survivants et de passagers morts.

In [15]:
cur.execute("SELECT Survived,COUNT(Survived), COUNT(*) * 100.0 / (SELECT COUNT(*) FROM LIENS) AS percent FROM LIENS group by Survived;")
rows = cur.fetchall()

def survivant(s):
    if s == "0":
        return "survivants"
    return "morts"

for row in rows:
    survived,nombre,pourcent = row
    vie = survivant(survived)
    print("Sur Titanic, on aperçoit {} de {}, il y a donc {}% de {}".format(nombre,vie,round(pourcent,2),vie))

Sur Titanic, on aperçoit 549 de survivants, il y a donc 61.62% de survivants
Sur Titanic, on aperçoit 342 de morts, il y a donc 38.38% de morts

# Visualiser la répartition des passagers survivants et morts par classe.

In [16]:
cur.execute("CREATE or replace VIEW PASSAGERCLASSE AS SELECT Pclass,Survived,count(Survived) FROM LIENS NATURAL JOIN TICKETS GROUP BY Pclass,Survived;")
conn.commit()
cur.execute("SELECT * FROM PASSAGERCLASSE;")
rows = cur.fetchall()

for row in rows:
    classe,survived,nombre = row
    vie = survivant(survived)
    print("Pour la classe {}, on compte {} de {}".format(classe,nombre,vie))

Pour la classe 2, on compte 87 de morts
Pour la classe 1, on compte 136 de morts
Pour la classe 2, on compte 97 de survivants
Pour la classe 3, on compte 372 de survivants
Pour la classe 3, on compte 119 de morts
Pour la classe 1, on compte 80 de survivants

# Visualiser la répartition des passagers survivants et des passagers décédés selon le sexe

In [17]:
cur.execute("CREATE or replace VIEW PASSAGERSEXE AS SELECT Sex,Survived,COUNT(*) FROM LIENS NATURAL JOIN PASSENGERS GROUP BY Sex,Survived;")
conn.commit()
cur.execute("SELECT * FROM PASSAGERSEXE;")
rows = cur.fetchall()

for row in rows:
    sexe,survived,nombre = row
    vie = survivant(survived)
    genre = SexeGenre(sexe)
    if sexe == "female" :
        vie = vie[:-1] + "es"
    print("Dans Titanic, on compte {} {} {}".format(nombre,genre,vie))

Dans Titanic, on compte 81 de femmes survivantes
Dans Titanic, on compte 109 d'hommes morts
Dans Titanic, on compte 468 d'hommes survivants
Dans Titanic, on compte 233 de femmes mortes

In [18]:
conn.close() #Ferme la connection